/*-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/**
 * 控制台警告信息
 * @param warnMessage
 */
export const useConsoleWarn = (warnMessage: string) => {
  console.warn(`@gexk/gxk: ${warnMessage}`);
};

/*-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/**
 * 控制台错误信息
 * @param errMessage
 */
export const useConsoleError = (errMessage: string) => {
  console.error(`@gexk/gxk: ${errMessage}`);
};
